{
    "books": [
      {
        "name": "The Power of Now",
        "author": "Eckhart Tolle",
        "categories": ["Inspirational", "Non-fiction"],
        "number_of_pages": 236,
        "year_of_publication": 1997,
        "language": "English",
        "description": "The Power of Now is a spiritual guide that encourages readers to live in the present moment and break free from the constant cycle of negative thoughts. Eckhart Tolle explains how letting go of past regrets and future anxieties can lead to a deeper sense of peace and fulfillment. The book delves into the concept of the 'now' and offers practical advice on how to detach from the mind's endless chatter. A bestseller, it has impacted millions of lives with its profound teachings on mindfulness and consciousness.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/f2/ff/92/f2ff92d1acec13446b566238c766ec6c.jpg"
      },
      {
        "name": "Atomic Habits",
        "author": "James Clear",
        "categories": ["Motivational", "Non-fiction"],
        "number_of_pages": 320,
        "year_of_publication": 2018,
        "language": "English",
        "description": "Atomic Habits offers a groundbreaking approach to personal development. James Clear explains how small, incremental changes in habits can lead to remarkable transformations in one's life. The book highlights the science behind habit formation and provides actionable strategies for building good habits while breaking bad ones. Drawing on research from various fields, the book makes the case for focusing on systems and processes rather than goals alone. It's a must-read for anyone looking to make positive, lasting changes in their daily life.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/20/d1/a6/20d1a65703a999cd0b39f87d7bb41c1d.jpg"
      },
      {
        "name": "Pride and Prejudice",
        "author": "Jane Austen",
        "categories": ["Romance", "Fiction"],
        "number_of_pages": 279,
        "year_of_publication": 1813,
        "language": "English",
        "description": "Pride and Prejudice is one of Jane Austen's most beloved novels. The story centers around the intelligent and headstrong Elizabeth Bennet and the proud yet aloof Mr. Darcy, who initially seem destined for conflict but ultimately fall in love. Set in 19th century England, the book explores themes of love, marriage, societal expectations, and personal growth. Austen's witty commentary on the complexities of relationships and her richly developed characters have made the novel an enduring classic of English literature.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/22/57/f6/2257f60e84967cfa6fa9427fdc0cef46.jpg"
      },
      {
        "name": "The Diary of a Young Girl",
        "author": "Anne Frank",
        "categories": ["Biographies", "Historical"],
        "number_of_pages": 283,
        "year_of_publication": 1947,
        "language": "Dutch",
        "description": "The Diary of a Young Girl is the poignant account of Anne Frank's life during the Holocaust. Written while she was in hiding from the Nazis, Anne's diary offers an intimate, deeply emotional perspective on the struggles she faced, her hopes, fears, and dreams. The book is a testament to the resilience of the human spirit in the face of unimaginable hardship. Anne's writing remains an inspiring and heartbreaking reminder of the impact of war and persecution, as well as the importance of freedom and human rights.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/bb/19/6d/bb196d36e6adb4c2fbf0d8fa082c8835.jpg"
      },
      {
        "name": "Sapiens: A Brief History of Humankind",
        "author": "Yuval Noah Harari",
        "categories": ["Non-fiction", "Scientific", "Historical"],
        "number_of_pages": 443,
        "year_of_publication": 2011,
        "language": "Hebrew",
        "description": "Sapiens takes readers on a journey through the history of humankind, from the earliest days of Homo sapiens to the present. Yuval Noah Harari explores how human beings evolved, the development of societies, the rise of empires, and the impact of science and technology on civilization. The book challenges traditional views on history and delves into topics such as the agricultural revolution, the formation of religions, capitalism, and the future of humanity. Harari's thought-provoking analysis has made Sapiens a global bestseller and sparked discussions on the future of our species.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/5b/6f/d6/5b6fd6104b3e712b3157e2add817ff7b.jpg"
      },
      {
        "name": "The Holy Bible",
        "author": "Various",
        "categories": ["Religious", "Reference"],
        "number_of_pages": 1200,
        "year_of_publication": "Varies (ancient text)",
        "language": "Multiple languages",
        "description": "The Holy Bible is the central religious text of Christianity, comprising two main sections: the Old Testament and the New Testament. It is considered by Christians to be the inspired word of God. The Old Testament covers the history of Israel and God's covenant with His people, while the New Testament focuses on the life and teachings of Jesus Christ. The Bible has been translated into numerous languages and continues to influence literature, culture, law, and personal beliefs across the globe.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/5f/a8/b0/5fa8b0d8a5bfcee2f0ad17ae72438f25.jpg"
      },
      {
        "name": "National Geographic Magazine",
        "author": "National Geographic Society",
        "categories": ["Magazines", "Non-fiction"],
        "number_of_pages": 100,
        "year_of_publication": 1888,
        "language": "English",
        "description": "National Geographic Magazine is one of the most well-known publications, offering a wealth of knowledge on science, geography, history, and culture. Each issue provides stunning photography, in-depth articles, and explorations of the natural world, wildlife, and human history. Over its long history, National Geographic has become a trusted resource for readers who seek to understand the world around them, from ancient civilizations to contemporary environmental issues. The magazine continues to inspire curiosity and a sense of wonder about our planet.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/44/d7/ba/44d7ba888ddb17be4ba7ec8d8a7e2706.jpg"
      },
      {
        "name": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "categories": ["Fiction", "Historical"],
        "number_of_pages": 180,
        "year_of_publication": 1925,
        "language": "English",
        "description": "The Great Gatsby is a classic novel set in the Jazz Age of the 1920s. It tells the story of the mysterious and wealthy Jay Gatsby, who spends his life pining for his lost love, Daisy Buchanan. Narrated by Nick Carraway, the book explores themes of love, ambition, and the American Dream. Fitzgerald's portrayal of the opulent but hollow lives of the rich, along with his sharp critique of American society during the Roaring Twenties, has made the novel a key work in American literature and a powerful reflection on the disillusionment of the era.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/6f/ad/5b/6fad5b3494f67dc6bef9f29bb3e97f0d.jpg"
      },
      {
        "name": "The Four Agreements",
        "author": "Don Miguel Ruiz",
        "categories": ["Inspirational", "Non-fiction"],
        "number_of_pages": 160,
        "year_of_publication": 1997,
        "language": "English",
        "description": "The Four Agreements is a guide to personal freedom based on ancient Toltec wisdom. Don Miguel Ruiz offers four principles for creating a life filled with love and happiness. The book emphasizes how freeing ourselves from limiting beliefs, negative patterns, and societal expectations can lead to inner peace. By embracing the four agreements—Be impeccable with your word, Don't take anything personally, Don't make assumptions, and Always do your best—we can live a more authentic and fulfilling life.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/a3/82/e1/a382e1ec3e0529c272fae3947eeed53e.jpg"
      },
      {
        "name": "Think and Grow Rich",
        "author": "Napoleon Hill",
        "categories": ["Motivational", "Non-fiction"],
        "number_of_pages": 238,
        "year_of_publication": 1937,
        "language": "English",
        "description": "Think and Grow Rich is a timeless classic on the principles of personal success. Napoleon Hill outlines 13 key steps to wealth and prosperity, focusing on the power of the mind, desire, and persistence. The book teaches the importance of having a clear goal, surrounding yourself with like-minded people, and maintaining a positive mental attitude. Hill draws upon his interviews with successful individuals to offer practical insights into the mindset and habits that contribute to financial and personal success.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/89/59/4e/89594ec4c7aea0e1579dc738afb9fefa.jpg"
      },
      {
        "name": "The Fault in Our Stars",
        "author": "John Green",
        "categories": ["Romance", "Fiction"],
        "number_of_pages": 313,
        "year_of_publication": 2012,
        "language": "English",
        "description": "The Fault in Our Stars is a touching and heartbreaking story about two teenagers who fall in love after meeting in a cancer support group. Hazel Grace and Augustus Waters navigate their illnesses, relationships, and the uncertainties of life together. John Green beautifully captures the essence of young love, the fragility of life, and the strength of the human spirit in the face of suffering. The book has been praised for its realistic portrayal of illness, love, and the difficult questions about mortality.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/bc/01/fd/bc01fd9a3fbaa1fc9c0e8bd3d1d02f64.jpg"
      },
      {
        "name": "Steve Jobs",
        "author": "Walter Isaacson",
        "categories": ["Biographies", "Non-fiction"],
        "number_of_pages": 656,
        "year_of_publication": 2011,
        "language": "English",
        "description": "Steve Jobs by Walter Isaacson is the authorized biography of the iconic founder of Apple. Based on extensive interviews with Jobs, his family, colleagues, and friends, the book gives an in-depth look into Jobs' extraordinary life and career. It chronicles his visionary work at Apple, his creativity, his leadership style, and his passion for innovation. The biography also explores his personal struggles and contradictions, offering a complete picture of the man behind the revolutionary technology that changed the world.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/0a/21/db/0a21dbaffd6760da27768040b891ec86.jpg"
      },
      {
        "name": "1984",
        "author": "George Orwell",
        "categories": ["Fiction", "Historical"],
        "number_of_pages": 328,
        "year_of_publication": 1949,
        "language": "English",
        "description": "1984 is George Orwell's dystopian novel set in a totalitarian society where the government, led by the Party and its leader Big Brother, controls every aspect of life. Winston Smith, the protagonist, begins to question the oppressive regime and the reality it constructs for its citizens. The novel explores themes of surveillance, censorship, and the dangers of totalitarianism. Orwell's chilling vision of the future continues to resonate as a cautionary tale about the loss of personal freedom and the abuse of power.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/17/fb/e1/17fbe1b3096863d5af032ce42c80c79c.jpg"
      },
      {
        "name": "A Brief History of Time",
        "author": "Stephen Hawking",
        "categories": ["Scientific", "Non-fiction"],
        "number_of_pages": 212,
        "year_of_publication": 1988,
        "language": "English",
        "description": "A Brief History of Time is a groundbreaking work that explores the nature of the universe, time, and space. Stephen Hawking takes complex scientific concepts and explains them in a way that is accessible to the general reader. The book delves into topics such as black holes, the Big Bang theory, the nature of time, and the search for a unified theory of physics. Despite its scientific depth, Hawking's ability to simplify complex topics has made the book a global bestseller and an introduction to the wonders of modern cosmology.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/03/ea/6a/03ea6ac4b906045ba40bacbf7aaf3f58.jpg"
      },
      {
        "name": "The Quran",
        "author": "Various",
        "categories": ["Religious", "Reference"],
        "number_of_pages": 604,
        "year_of_publication": "Varies (ancient text)",
        "language": "Arabic",
        "description": "The Quran is the central religious text of Islam, regarded by Muslims as the literal word of God as revealed to the Prophet Muhammad. It consists of 114 surahs (chapters) that provide guidance on worship, morality, law, and personal conduct. The Quran is considered the final and most complete scripture by Muslims, and it has had a profound influence on Islamic culture, law, and philosophy. Its verses are recited daily by millions of Muslims around the world as part of their prayers and personal devotion.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/75/2f/98/752f98fb29e6d202cf9270b36966abf3.jpg"
      },
      {
        "name": "Time Magazine",
        "author": "Time Inc.",
        "categories": ["Magazines", "Non-fiction"],
        "number_of_pages": 60,
        "year_of_publication": 1923,
        "language": "English",
        "description": "Time Magazine is one of the most renowned American news magazines, covering global events, politics, economics, science, and culture. Each issue offers in-depth reporting on current events, interviews with key figures, and analysis of global trends. Time has been instrumental in shaping public discourse through its covers and articles, highlighting critical issues such as climate change, social justice, and technological advancements. It remains a leading source for authoritative journalism and insights into world affairs.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/90/3d/6d/903d6d71206ad729cff06bb59338d994.jpg"
      },
      {
        "name": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "categories": ["Fiction", "Historical"],
        "number_of_pages": 277,
        "year_of_publication": 1951,
        "language": "English",
        "description": "The Catcher in the Rye is J.D. Salinger's classic novel about the disillusioned teenage protagonist, Holden Caulfield. The story takes place in 1940s New York and follows Holden's journey as he struggles with the loss of innocence and the pressures of adulthood. Narrated in the first person, the novel captures Holden's complex emotions as he navigates feelings of alienation, depression, and confusion. It has become one of the most influential works in American literature, reflecting the challenges of adolescence and the search for identity.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/53/33/4f/53334fc80a12be02195f18d23f7ad46c.jpg"
      },
      {
        "name": "The Art of War",
        "author": "Sun Tzu",
        "categories": ["Historical", "Non-fiction"],
        "number_of_pages": 68,
        "year_of_publication": "5th century BC",
        "language": "Chinese",
        "description": "The Art of War is an ancient Chinese military treatise that focuses on strategy, tactics, and warfare. Written by the philosopher Sun Tzu, the work outlines principles for successfully navigating conflict, whether on the battlefield or in other areas of life, such as business and personal relationships. It emphasizes the importance of adaptability, intelligence, and psychological warfare, and it has been widely applied across various fields as a guide to strategy, leadership, and decision-making.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/54/a9/f6/54a9f6d4dcb117430de5184bc9826580.jpg"
      },
      {
        "name": "The Alchemist",
        "author": "Paulo Coelho",
        "categories": ["Fiction", "Inspirational"],
        "number_of_pages": 208,
        "year_of_publication": 1988,
        "language": "Portuguese",
        "description": "The Alchemist is a philosophical novel by Paulo Coelho that tells the story of Santiago, a young shepherd from Spain who dreams of finding treasure. His journey takes him across the desert, where he learns life lessons about following his dreams, listening to his heart, and seeking personal fulfillment. The book is an allegory about self-discovery, the importance of pursuing one's 'Personal Legend,' and the interconnectedness of all things. The Alchemist has inspired millions of readers around the world with its message of hope and perseverance.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/c1/10/ce/c110ceaf9de240ab25b15a26b0e3e65e.jpg"
      },
      {
        "name": "The Great Expectations",
        "author": "Charles Dickens",
        "categories": ["Fiction", "Historical"],
        "number_of_pages": 505,
        "year_of_publication": 1861,
        "language": "English",
        "description": "Great Expectations is one of Charles Dickens' most famous novels, following the life of Pip, an orphan who is given the opportunity to become a gentleman. The novel explores themes of social class, wealth, love, and betrayal as Pip navigates his newfound expectations. Throughout his journey, he learns about the complexities of human nature, the consequences of ambition, and the value of personal growth. Dickens' rich storytelling, memorable characters, and social commentary make this a classic of English literature.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/36/a7/cd/36a7cdd8608bfafcc8896373fcfe289e.jpg"
      },
      {
        "name": "The Secret",
        "author": "Rhonda Byrne",
        "categories": ["Inspirational", "Non-fiction"],
        "number_of_pages": 198,
        "year_of_publication": 2006,
        "language": "English",
        "description": "The Secret reveals the law of attraction, a principle that suggests that thinking positively can bring good things into one's life. Rhonda Byrne shares stories from people who have used this secret to achieve their desires. The book encourages readers to focus on what they want rather than what they don’t want, creating a mindset that attracts abundance, success, and happiness. It has inspired millions worldwide and sparked widespread interest in personal development and the power of positive thinking.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/53/85/4a/53854a472173140d83b909d4f8f8dc70.jpg"
      },
      {
        "name": "Man’s Search for Meaning",
        "author": "Viktor Frankl",
        "categories": ["Inspirational", "Non-fiction"],
        "number_of_pages": 200,
        "year_of_publication": 1946,
        "language": "English",
        "description": "Man's Search for Meaning is a powerful and personal account of Viktor Frankl's experiences as a Holocaust survivor. The book explores Frankl's theory of logotherapy, a form of psychotherapy that focuses on finding meaning in life, even in the most difficult circumstances. Frankl argues that the primary motivation in life is not pleasure but the discovery and pursuit of what is meaningful. This book has inspired countless readers worldwide with its message of hope, resilience, and the importance of purpose in life.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/c8/6f/c1/c86fc10e0f1615977bce27548967c637.jpg"
      },
      {
        "name": "The Road",
        "author": "Cormac McCarthy",
        "categories": ["Fiction", "Historical"],
        "number_of_pages": 287,
        "year_of_publication": 2006,
        "language": "English",
        "description": "The Road is a bleak and powerful post-apocalyptic novel that follows a father and son as they journey through a devastated world. As they struggle to survive in the face of death and destruction, the bond between them deepens, and they cling to the hope of finding something better. McCarthy's sparse, poetic prose adds to the novel's haunting atmosphere, and its exploration of love, survival, and the human condition makes it a deeply moving and thought-provoking work.",
        "comments":0,
        "image_url": "https://i.pinimg.com/736x/4c/04/37/4c0437a28d7030d1c08aa0f426081e8a.jpg"
      },
      {
        "name": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "categories": ["Fiction", "Historical"],
        "number_of_pages": 281,
        "year_of_publication": 1960,
        "language": "English",
        "description": "To Kill a Mockingbird is a Pulitzer Prize-winning novel set in the racially segregated South during the 1930s. The story is told through the eyes of Scout Finch, a young girl whose father, Atticus Finch, is a lawyer defending a black man falsely accused of raping a white woman. The book explores themes of justice, racism, and moral integrity, and its powerful portrayal of the complexities of human behavior and social injustice has made it a key work in American literature.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/7d/81/12/7d81126b16b9a12ecc67d395f45e4863.jpg"
      },
      {
        "name": "Educated",
        "author": "Tara Westover",
        "categories": ["Biographies", "Non-fiction"],
        "number_of_pages": 334,
        "year_of_publication": 2018,
        "language": "English",
        "description": "Educated is a memoir by Tara Westover about her journey from growing up in a strict, survivalist family in rural Idaho to earning a PhD from the University of Cambridge. Her story is one of resilience, self-discovery, and the transformative power of education. Tara's struggle to reconcile her upbringing with the outside world, and her eventual escape from a life of isolation and ignorance, is both heart-wrenching and inspiring. The book has been widely praised for its honest and gripping narrative.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/00/cf/87/00cf87842a7d812210fb6d3069a9da0c.jpg"
      },
      {
        "name": "Becoming",
        "author": "Michelle Obama",
        "categories": ["Biographies", "Non-fiction"],
        "number_of_pages": 448,
        "year_of_publication": 2018,
        "language": "English",
        "description": "Becoming is the memoir of former First Lady Michelle Obama, offering an intimate look at her life from her childhood in Chicago to her years in the White House. The book reflects on her personal experiences with race, gender, and identity, as well as her evolution as a leader, mother, and public figure. Michelle Obama's candid and inspiring story resonates with readers, encouraging them to find their own paths to success and fulfillment while staying true to themselves.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/73/52/b6/7352b62120c8b68da1910f0372aedb56.jpg"
      },
      {
        "name": "The Hitchhiker's Guide to the Galaxy",
        "author": "Douglas Adams",
        "categories": ["Fiction", "Sci-fi"],
        "number_of_pages": 224,
        "year_of_publication": 1979,
        "language": "English",
        "description": "The Hitchhiker's Guide to the Galaxy is a comic science fiction series by Douglas Adams that follows the misadventures of Arthur Dent, a man who is whisked off Earth just before it is destroyed to make way for a new intergalactic freeway. The novel combines humor, satire, and existential philosophy, making it a beloved classic. Its absurdity, quirky characters, and memorable one-liners have made it a cult favorite, and it has since spawned multiple sequels and adaptations.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/11/7f/eb/117feb10448cda214c66302ed6c1dd87.jpg"
      },
      {
        "name": "The Power of Habit",
        "author": "Charles Duhigg",
        "categories": ["Motivational", "Non-fiction"],
        "number_of_pages": 371,
        "year_of_publication": 2012,
        "language": "English",
        "description": "The Power of Habit explores the science behind why habits form and how they can be changed. Charles Duhigg examines how habits impact personal success, productivity, and organizational efficiency. Drawing on research in neuroscience, psychology, and business, the book offers practical strategies for breaking bad habits and creating positive ones. It’s an insightful look at how the brain works and how small changes can lead to massive improvements in daily life.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/ee/a4/d7/eea4d7560b7c5baf4eea6a07a85b1f67.jpg"
      },
      {
        "name": "The Girl on the Train",
        "author": "Paula Hawkins",
        "categories": ["Fiction", "Thriller"],
        "number_of_pages": 395,
        "year_of_publication": 2015,
        "language": "English",
        "description": "The Girl on the Train is a psychological thriller that follows the intertwining lives of three women. The story is narrated from the perspectives of Rachel, Anna, and Megan, whose lives become tangled in a web of lies, deception, and murder. As Rachel becomes obsessed with a woman she believes she has seen from a train, she is drawn into a complex investigation that leads her to shocking revelations. The novel has been praised for its gripping plot and unreliable narrators, keeping readers on edge until the very end.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/c7/70/a7/c770a7ccaec9157540c9ec0cf83c6e2d.jpg"
      },
      {
        "name": "The Giver",
        "author": "Lois Lowry",
        "categories": ["Fiction", "Dystopian"],
        "number_of_pages": 180,
        "year_of_publication": 1993,
        "language": "English",
        "description": "The Giver is a young adult dystopian novel set in a society where emotions are suppressed, and individuality is eradicated. The protagonist, Jonas, is chosen to be the Receiver of Memory, a position that grants him access to the deep emotions and memories of the past. As Jonas learns the truth about his society, he is forced to confront the realities of freedom, choice, and the cost of living in a perfect world. The book explores themes of conformity, memory, and the meaning of life.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/09/ab/f9/09abf912b5bcb2a09a294189c6a55abd.jpg"
      },
      {
        "name": "Fahrenheit 451",
        "author": "Ray Bradbury",
        "categories": ["Fiction", "Dystopian"],
        "number_of_pages": 158,
        "year_of_publication": 1953,
        "language": "English",
        "description": "Fahrenheit 451 is a classic dystopian novel set in a future society where books are banned, and firemen burn them. Guy Montag, a fireman, begins to question the oppressive government that controls the lives of its citizens. As he explores the world of books, he begins to see the truth about the society in which he lives. Ray Bradbury’s novel is a powerful critique of censorship, conformity, and the loss of intellectual freedom, highlighting the importance of free thought and self-expression.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/a7/7e/cf/a77ecf098659b16e1521bf447eff104f.jpg"
      },
      {
        "name": "The Shining",
        "author": "Stephen King",
        "categories": ["Fiction", "Horror"],
        "number_of_pages": 447,
        "year_of_publication": 1977,
        "language": "English",
        "description": "The Shining is a horror novel that tells the story of Jack Torrance, a man who accepts a job as the winter caretaker of the isolated Overlook Hotel. As the winter progresses, Jack’s sanity begins to unravel under the influence of the hotel’s malevolent supernatural forces. The novel explores themes of isolation, madness, and the haunting power of the past. With its terrifying atmosphere and psychological depth, The Shining is considered one of Stephen King's most iconic works.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/b5/1e/5b/b51e5b6cc44e5aa0fac1e8a42b4fba0c.jpg"
      },
      {
        "name": "The Silent Patient",
        "author": "Alex Michaelides",
        "categories": ["Fiction", "Thriller"],
        "number_of_pages": 325,
        "year_of_publication": 2019,
        "language": "English",
        "description": "The Silent Patient is a psychological thriller that centers around Alicia Berenson, a famous artist who shoots her husband in the face and then stops speaking. Theo Faber, a forensic psychologist, becomes fascinated by Alicia's case and is determined to uncover the truth. As Theo delves deeper into Alicia’s past and her silence, he uncovers shocking secrets that lead to an unexpected and gripping conclusion. The novel explores themes of obsession, trauma, and the power of silence.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/ee/c3/7c/eec37c45c2b005f960546946d242308a.jpg"
      },
      {
        "name": "The Night Circus",
        "author": "Erin Morgenstern",
        "categories": ["Fiction", "Fantasy"],
        "number_of_pages": 387,
        "year_of_publication": 2011,
        "language": "English",
        "description": "The Night Circus is a mesmerizing fantasy novel set around a magical, traveling circus that opens only at night. The story follows two young magicians, Celia and Marco, who are bound by a mysterious competition. As the circus becomes their battleground, they must navigate the intricate world of magic and illusion while struggling to balance their growing feelings for each other. Morgenstern's lyrical prose and vivid imagery make this novel a captivating, dreamlike experience for readers.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/b4/b5/33/b4b533b1e8d9b73d96a67fcc85c8993b.jpg"
      },
      {
        "name": "The Book Thief",
        "author": "Markus Zusak",
        "categories": ["Historical", "Fiction"],
        "number_of_pages": 550,
        "year_of_publication": 2005,
        "language": "English",
        "description": "The Book Thief is set during World War II and follows a young girl named Liesel Meminger, who steals books and shares them with others in Nazi Germany. Narrated by Death, the novel explores themes of loss, love, and the power of words in a time of terror and hardship. Liesel's relationships with her foster parents, friends, and the Jewish man hiding in their basement form the emotional heart of the novel. This poignant story is a testament to the resilience of the human spirit in times of darkness.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/8d/89/66/8d8966c1e810e4ea1465b4d86cb24211.jpg"
      },
      
      {
        "name": "The Hunger Games",
        "author": "Suzanne Collins",
        "categories": ["Fiction", "Dystopian"],
        "number_of_pages": 374,
        "year_of_publication": 2008,
        "language": "English",
        "description": "The Hunger Games is a dystopian novel set in a future where a totalitarian government forces children from each district to participate in a televised battle to the death. The story follows Katniss Everdeen, a young girl who volunteers to take her sister's place in the deadly games. As she navigates the brutal arena, Katniss must rely on her wit, survival skills, and inner strength to survive. The novel explores themes of sacrifice, survival, and the effects of violence and power on society.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/f4/a4/81/f4a481142af699ec0d8a67642af76938.jpg"
      },
      {
        "name": "The Subtle Art of Not Giving a F*ck",
        "author": "Mark Manson",
        "categories": ["Motivational", "Non-fiction"],
        "number_of_pages": 224,
        "year_of_publication": 2016,
        "language": "English",
        "description": "The Subtle Art of Not Giving a F*ck challenges conventional wisdom about happiness and success, encouraging readers to let go of the pursuit of constant positivity and instead focus on the things that truly matter. Mark Manson advocates for embracing life's challenges and accepting that failure, pain, and disappointment are part of the human experience. With humor and tough-love advice, the book offers a refreshing perspective on how to live a more meaningful and authentic life.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/1f/5a/df/1f5adf84bc471001a0e18b6a3bd0eccd.jpg"
      },
      {
        "name": "The 7 Habits of Highly Effective People",
        "author": "Stephen R. Covey",
        "categories": ["Motivational", "Non-fiction"],
        "number_of_pages": 381,
        "year_of_publication": 1989,
        "language": "English",
        "description": "The 7 Habits of Highly Effective People is a self-help classic that teaches individuals how to improve their personal and professional lives. Covey’s principles revolve around personal responsibility, time management, and effective communication. By focusing on proactive behavior, prioritizing important tasks, and fostering mutual respect, Covey provides readers with a comprehensive guide for achieving success in any area of life. The book has influenced millions and remains a staple of personal development literature.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/d6/6d/d5/d66dd5d0de20e1c1e11886347cdea33a.jpg"
      },
      {
        "name": "The Outsiders",
        "author": "S.E. Hinton",
        "categories": ["Fiction", "Young Adult"],
        "number_of_pages": 192,
        "year_of_publication": 1967,
        "language": "English",
        "description": "The Outsiders is a coming-of-age novel that focuses on the struggles between two rival groups of teenagers: the Greasers and the Socs. The story, narrated by Ponyboy Curtis, explores themes of class, loyalty, and identity as the characters navigate the challenges of adolescence. The novel has become a classic for its raw depiction of the trials faced by young people, making it a powerful and enduring piece of literature.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/be/e1/2b/bee12b00946cf67477c469fd47b2015b.jpg"
      },
      {
        "name": "The Picture of Dorian Gray",
        "author": "Oscar Wilde",
        "categories": ["Fiction", "Classic"],
        "number_of_pages": 254,
        "year_of_publication": 1890,
        "language": "English",
        "description": "The Picture of Dorian Gray tells the story of a handsome young man named Dorian Gray, who becomes infatuated with youth and beauty. He makes a Faustian bargain that allows his portrait to age while he remains youthful and untouched by time. As Dorian indulges in a life of excess and moral corruption, the consequences of his actions are reflected in his portrait, leading to a tragic downfall. Wilde’s novel explores themes of vanity, corruption, and the pursuit of pleasure.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/56/09/49/56094908bdd8e2c8e88eda085a10c370.jpg"
      },
      {
        "name": "The 5 AM Club",
        "author": "Robin Sharma",
        "categories": ["Self-Help", "Motivational"],
        "number_of_pages": 336,
        "year_of_publication": 2018,
        "language": "English",
        "description": "In The 5 AM Club, Robin Sharma presents a powerful message about the importance of starting your day early and using the first few hours of the morning to achieve peak performance and personal growth. The book follows the journey of an entrepreneur, a struggling artist, and a billionaire mentor who shares his wisdom about how waking up at 5 AM can transform their lives. According to Sharma, the early morning hours are a time for deep focus, self-reflection, and physical activity, which set the tone for a productive and successful day. The 5 AM Club is not just about waking up early; it is a blueprint for creating a balanced, fulfilled life by focusing on the three key pillars of personal growth: health, wealth, and wisdom. Through practical tips and inspiring stories, Sharma explains how small daily habits, such as exercise, meditation, and learning, can lead to extraordinary results over time. The book encourages readers to take control of their mornings, design their routines around their personal goals, and unlock their potential for success. The 5 AM Club is a guide to mastering the morning and, in turn, mastering your life.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/57/ed/76/57ed760cc88602abb2251f1b8d9bd29e.jpg"
      },
      {
        "name": "Be Here Now",
        "author": "Ram Dass",
        "categories": ["Spiritual", "Self-Help"],
        "number_of_pages": 416,
        "year_of_publication": 1971,
        "language": "English",
        "description": "Be Here Now, written by Ram Dass, is a groundbreaking spiritual classic that has inspired generations of readers seeking to explore consciousness, meditation, and the deeper dimensions of existence. The book was first published in the early 1970s and offers a unique blend of autobiography, spiritual teachings, and illustrated wisdom. In Be Here Now, Ram Dass (formerly Richard Alpert) chronicles his journey from Harvard professor to spiritual seeker, after encountering the teachings of his guru, Neem Karoli Baba, in India. The book emphasizes the importance of being present in the moment and disconnecting from the distractions of the mind and ego. Through anecdotes, poetry, and meditative reflections, Ram Dass encourages readers to embrace the concept of mindfulness and practice self-awareness in daily life. The book is divided into three sections: the first part covers the author’s transformation from a Western intellectual to a spiritual student; the second part presents various spiritual practices and insights; and the third part is a guide for integrating these teachings into one’s life. Be Here Now has become a revered text in the field of spiritual literature, offering a profound and accessible approach to the path of enlightenment, inner peace, and self-realization.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/04/7f/2a/047f2a3b998816eccf8fb18d0aca2fc9.jpg"
      },
      {
        "name": "Outliers: The Story of Success",
        "author": "Malcolm Gladwell",
        "categories": ["Non-Fiction", "Scientific"],
        "number_of_pages": 309,
        "year_of_publication": 2008,
        "language": "English",
        "description": "Outliers: The Story of Success by Malcolm Gladwell explores the factors that contribute to high levels of success. Gladwell argues that success is not simply a matter of individual talent or hard work, but rather the result of a combination of external factors, including timing, cultural background, and the opportunities people are given. Through fascinating case studies and examples, Gladwell challenges the traditional notion of the 'self-made' individual, showing that successful people are often the beneficiaries of unique circumstances and advantages. One of the key concepts in the book is the 10,000-hour rule, which suggests that to become truly exceptional at something, one must put in at least 10,000 hours of practice. The book also examines the role of cultural legacy and the impact of family, education, and community in shaping one’s path to success. Outliers is a thought-provoking and eye-opening look at what it takes to achieve greatness, and it offers a fresh perspective on how we define success in society. The book is both accessible and engaging, making it a must-read for anyone interested in understanding the hidden forces that drive achievement.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/1a/bd/01/1abd01ae0a9eb204a9a299c6fb7985b1.jpg"
      },
      {
        "name": "The Midnight Library",
        "author": "Matt Haig",
        "categories": ["Fiction", "Fantasy"],
        "number_of_pages": 304,
        "year_of_publication": 2020,
        "language": "English",
        "description": "The Midnight Library by Matt Haig explores the life of Nora Seed, a woman on the brink of despair. After a series of life setbacks, she contemplates ending it all, but instead finds herself in a mysterious library that exists between life and death. This library, filled with countless books, offers Nora the opportunity to experience an infinite number of parallel lives. Each book represents a different path she could have taken if she had made different decisions. From being a rock star to a scientist, Nora explores these alternate realities, but as she tries to find meaning in these new lives, she grapples with the question: What makes life worth living? The novel beautifully explores themes of regret, choice, and fulfillment. As Nora confronts her past, she learns that living a life free of regrets is not the key to happiness—it's about accepting imperfection and embracing the present moment. The Midnight Library is a moving, thought-provoking story that will resonate with anyone who has ever wondered about the road not taken. Haig combines elements of fantasy with emotional depth, creating a powerful narrative about how one’s choices shape their sense of self and fulfillment. It’s a meditation on the infinite possibilities within our lives and a reminder that every moment is precious, and change is always within reach.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/64/25/11/6425119c1b5abc87e68124edcf944476.jpg"
      },
      {
        "name": "Where the Crawdads Sing",
        "author": "Delia Owens",
        "categories": ["Fiction", "Mystery"],
        "number_of_pages": 368,
        "year_of_publication": 2018,
        "language": "English",
        "description": "Where the Crawdads Sing is a haunting and captivating tale set in the remote marshlands of North Carolina, following the life of Kya Clark, a young girl abandoned by her family. Growing up isolated, Kya is labeled as the 'Marsh Girl' by the local townspeople. She survives alone, developing a deep connection with the natural world around her. Kya’s solitary life is disrupted when a murder occurs in the nearby town, and she becomes the prime suspect. As the story unfolds, the book alternates between two timelines: Kya’s childhood and her life as a young woman, as well as the investigation into the murder. Owens beautifully intertwines Kya’s struggle for acceptance with a compelling mystery, making this a thrilling, poignant, and deeply emotional story. Through Kya’s eyes, readers witness her incredible resilience and courage as she navigates loneliness, abandonment, and her search for belonging. The novel explores themes of love, isolation, and survival, as Kya’s journey mirrors the resilience of the human spirit and the power of nature. As Kya forms relationships with the few people who come into her life, she learns that true love is not just about connection with others but also about loving and accepting oneself. The book captivates with its richly drawn characters and evocative setting, offering a deep and immersive reading experience that lingers long after the final page.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/96/16/3e/96163ed69acef92e4efaea8cf1fc3bd1.jpg"
      },
      {
        "name": "Circe",
        "author": "Madeline Miller",
        "categories": ["Fantasy", "Mythology"],
        "number_of_pages": 400,
        "year_of_publication": 2018,
        "language": "English",
        "description": "Circe, by Madeline Miller, is a stunning reimagining of the Greek mythological character Circe, the powerful enchantress from Homer’s 'Odyssey.' The novel begins with Circe’s childhood, where she is a lesser god with no remarkable powers and is overlooked by her family. Over time, Circe’s latent abilities begin to manifest, and she is exiled to the island of Aiaia, where she hones her craft in witchcraft and spells. The novel traces Circe's journey from a passive, insecure goddess to a powerful, independent woman who challenges the gods and ultimately redefines her own destiny. Throughout the story, Miller breathes new life into Circe’s character, offering a deep exploration of loneliness, identity, and transformation. The book is a vivid exploration of love, power, betrayal, and the consequences of immortality. It delves into Circe’s relationships with legendary figures like Odysseus, Hermes, and the gods themselves, highlighting her struggles for agency in a world that treats her as an outsider. Circe is not just a tale of magic and myth; it is a story about finding one's place in the world, embracing inner strength, and breaking free from the expectations of others. With lush prose and a powerful feminist perspective, Circe is a captivating, thought-provoking read that will resonate with those who appreciate mythological tales with modern sensibilities.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/d8/dc/77/d8dc770c034754dee36cd59b9d531f26.jpg"
      },
      {
        "name": "Big Magic",
        "author": "Elizabeth Gilbert",
        "categories": ["Non-fiction", "Self-help"],
        "number_of_pages": 288,
        "year_of_publication": 2015,
        "language": "English",
        "description": "Big Magic by Elizabeth Gilbert is a celebration of creativity, courage, and the joy of living a life inspired by passion and curiosity. Gilbert, best known for her memoir 'Eat Pray Love,' explores how everyone can unlock their creative potential and live a more fulfilling life. She emphasizes that creativity is not reserved for artists or professionals, but is a force that can be accessed by anyone, regardless of their background or talents. Drawing on personal anecdotes, interviews, and research, Gilbert explores how fear often holds people back from pursuing their creative dreams and how embracing the unknown can open up new possibilities. The book provides practical advice for overcoming self-doubt, dealing with failure, and cultivating a mindset that allows for the free flow of ideas. Through its positive, encouraging tone, Big Magic seeks to remove the barriers that prevent people from creating—whether it's writing, painting, building, or any form of expression. The book reminds readers that creativity is not a magical gift, but a daily practice that requires action, commitment, and perseverance. With its focus on living a creative life, Gilbert's book serves as an uplifting and empowering guide for anyone looking to embrace their own artistic potential and unlock the magic in everyday life.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/43/19/ed/4319ed83f3a08c1a058ea44018ab67e0.jpg"
      },
      {
        "name": "The Nightingale",
        "author": "Kristin Hannah",
        "categories": ["Historical Fiction", "War"],
        "number_of_pages": 440,
        "year_of_publication": 2015,
        "language": "English",
        "description": "Kristin Hannah’s The Nightingale is a gripping and deeply emotional historical fiction novel set against the backdrop of World War II in France. The story revolves around two sisters, Vianne and Isabelle, who have contrasting approaches to surviving the war. Vianne, the older sister, is a mother and wife, focused on keeping her family safe in the occupied town of Carriveau. Isabelle, the younger, is fiery and rebellious, eager to join the French Resistance and fight back against the Nazi forces. The novel chronicles the struggles, sacrifices, and triumphs of these two women as they navigate the horrors of war. Vianne and Isabelle's divergent paths represent the varied responses to war’s brutality—one through quiet resistance and the other through direct action. The novel’s power lies in its exploration of sisterhood, courage, and the resilience of the human spirit. Throughout the book, readers are immersed in the emotional complexity of the characters as they face unimaginable hardships, making The Nightingale an unforgettable and poignant account of women’s lives during wartime. Hannah’s rich storytelling and vivid descriptions of the French landscape evoke a sense of place, while her exploration of the emotional toll of war highlights the strength and resilience of individuals caught in extraordinary circumstances. The Nightingale is a tribute to the unsung heroes of the war, particularly the women whose bravery and sacrifices often went unnoticed.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/72/14/9f/72149f4b4777f62f8ceba40a374565bc.jpg"
      },
      {
        "name": "A Little Life",
        "author": "Hanya Yanagihara",
        "categories": ["Fiction", "Contemporary"],
        "number_of_pages": 720,
        "year_of_publication": 2015,
        "language": "English",
        "description": "A Little Life by Hanya Yanagihara is a deeply emotional and harrowing exploration of friendship, trauma, and survival. The novel follows four college friends—Jude, Willem, JB, and Malcolm—as they navigate adulthood in New York City. While the novel centers on their friendship, it particularly focuses on Jude, whose traumatic past shapes his every interaction and decision. As the story unfolds, readers learn about Jude's horrific experiences, including abuse and unimaginable hardship, and how these experiences continue to affect his present-day life. A Little Life is a profound exploration of the long-lasting impacts of trauma, as well as the ways in which individuals cope with pain, loneliness, and emotional scars. At the same time, the novel offers a portrait of enduring friendship, highlighting the ways in which love, care, and connection can provide a semblance of healing and solace. The novel delves into the complexities of human relationships, revealing the depths of vulnerability, guilt, and emotional resilience. With its raw and unflinching portrayal of suffering and the search for redemption, A Little Life challenges readers to think deeply about identity, memory, and the strength required to survive unimaginable pain. It’s a masterpiece that is both heartbreaking and uplifting, leaving a lasting impression on anyone who reads it. It is an unflinching examination of trauma, friendship, and the possibility of healing.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/cb/58/38/cb5838989618397528fe718457897257.jpg"
      },
      {
        "name": "The Underground Railroad",
        "author": "Colson Whitehead",
        "categories": ["Historical Fiction", "Adventure"],
        "number_of_pages": 320,
        "year_of_publication": 2016,
        "language": "English",
        "description": "The Underground Railroad by Colson Whitehead is a powerful and inventive novel that reimagines the historical underground railroad as a literal railroad beneath the ground, offering a literal escape for enslaved individuals seeking freedom. The story follows Cora, a young woman who escapes from a Georgia plantation and embarks on a dangerous and harrowing journey toward freedom in the northern states. Along the way, she encounters both physical and psychological challenges, including betrayal, prejudice, and the terrifying power of slave catchers. Whitehead’s novel blends historical fiction with magical realism, creating a haunting portrayal of slavery and its devastating impact. The narrative tackles the brutality of slavery, racism, and the systemic oppression of African Americans, all while delivering a gripping, suspenseful story of survival. The novel also explores the idea of escape—not just in the physical sense, but as a journey toward self-discovery and hope. With its vivid prose and richly developed characters, The Underground Railroad highlights the resilience of the human spirit in the face of unimaginable suffering. By reimagining the underground railroad as an actual train system, Whitehead creates a compelling metaphor for the yearning for freedom and the lengths people will go to in order to attain it. This novel won the Pulitzer Prize for Fiction and the National Book Award, marking its place as a seminal work of contemporary literature.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/71/3c/e0/713ce0283de37802eb1f6a931bda1dbb.jpg"
      },
      {
        "name": "The Invisible Man",
        "author": "Ralph Ellison",
        "categories": ["Fiction", "Literary"],
        "number_of_pages": 581,
        "year_of_publication": 1952,
        "language": "English",
        "description": "The Invisible Man by Ralph Ellison is a groundbreaking novel that explores the theme of racial invisibility and the search for identity in a society that marginalizes and oppresses African Americans. The protagonist, an unnamed Black man, begins his story with a reflection on the power of invisibility—both literal and figurative. As he journeys through life, he is consistently denied his humanity by the world around him, becoming a victim of systemic racism, exploitation, and dehumanization. Throughout the novel, the protagonist struggles to find his place within society while grappling with the complexity of his own self-awareness and his internal conflict about what it means to exist as a Black man in a white-dominated world. His search for identity leads him to a series of encounters with individuals and groups that offer him different perspectives on the struggle for equality, freedom, and justice. The Invisible Man is a powerful exploration of the psychological effects of racism and the alienation it causes. Ellison’s novel is also a profound commentary on the American experience, offering a voice to the unheard and unseen. Through vivid symbolism and a deeply introspective narrative, Ellison creates a work that challenges readers to think critically about identity, race, and the impact of social forces on individual lives. It remains one of the most important works of American literature, both for its literary achievements and its lasting cultural relevance.",
        "comments": 1754,
        "image_url": "https://i.pinimg.com/736x/82/31/62/823162054047d378aa49248af38adc74.jpg"
      },
      {
        "name": "The Rosie Project",
        "author": "Graeme Simsion",
        "categories": ["Romantic Comedy", "Fiction"],
        "number_of_pages": 295,
        "year_of_publication": 2013,
        "language": "English",
        "description": "The Rosie Project by Graeme Simsion is a delightful, heartwarming romantic comedy that follows Don Tillman, a socially awkward but brilliant geneticist who decides to embark on a scientific quest to find his perfect match. Don’s approach to finding a wife is logical and methodical—he creates a detailed questionnaire, 'The Wife Project,' designed to find the ideal woman based on measurable qualities like IQ, punctuality, and food preferences. However, his carefully calculated plan is thrown off course when he meets Rosie Jarman, a free-spirited and unconventional woman who is nothing like the woman he believes he’s suited for. While Don’s initial interactions with Rosie are awkward and illogical, they soon develop a friendship that forces him to step outside his comfort zone and confront his assumptions about love, relationships, and the complexities of human connection. The Rosie Project is a joyful, humorous exploration of the quirks of love and the unpredictable nature of relationships. With its charming protagonist and lighthearted tone, the novel offers an uplifting message about the importance of acceptance, vulnerability, and stepping outside one’s comfort zone in order to experience personal growth and genuine connection. Don's journey of self-discovery is both touching and hilarious, making The Rosie Project a fun, thoughtful, and ultimately satisfying read.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/44/c6/59/44c659617ddbf8d7cfd15d23216bb1e8.jpg"
      },
      {
        "name": "The Book of Lost Things",
        "author": "John Connolly",
        "categories": ["Fantasy", "Fiction"],
        "number_of_pages": 400,
        "year_of_publication": 2006,
        "language": "English",
        "description": "The Book of Lost Things by John Connolly is a dark and enchanting tale that blends fantasy, mythology, and psychological drama. The story follows David, a young boy who, after the death of his mother, retreats into a world of books and imagination as a way to escape the pain of his grief. One day, David discovers a mysterious book that leads him into an alternate world—one that is twisted and filled with strange creatures and treacherous dangers. As David journeys through this fantastical realm, he learns more about himself and the nature of the world he once knew. The novel weaves together elements of classic fairy tales and darker, more mature themes, exploring the journey from childhood to adolescence, and the loss of innocence that comes with growing up. The Book of Lost Things is a powerful exploration of grief, fear, and the power of stories to help us navigate difficult times. Connolly’s writing is rich and evocative, with vivid descriptions that bring both the magical and the heartbreaking to life. It’s a story about the importance of memory, the value of stories, and the courage to face one’s deepest fears. This novel appeals to readers who appreciate tales that combine whimsy with darker, more profound insights into the human condition.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/48/e4/1b/48e41b48ef3a025dfd88e215e9a5150d.jpg"
      },
      {
        "name": "The Rosie Effect",
        "author": "Graeme Simsion",
        "categories": ["Romantic Comedy", "Fiction"],
        "number_of_pages": 406,
        "year_of_publication": 2014,
        "language": "English",
        "description": "The Rosie Effect is the charming sequel to The Rosie Project by Graeme Simsion. Picking up where the first book left off, the story follows Don Tillman and his wife Rosie as they navigate the challenges of married life. The couple is now living in New York, and Don is trying to adjust to his new life as a husband, while also dealing with the unexpected news that Rosie is pregnant. Don’s logical, scientific approach to life is put to the test as he grapples with the complexities of fatherhood, relationships, and social expectations. As Don faces one obstacle after another in his efforts to prepare for fatherhood, he finds himself questioning his abilities and his understanding of relationships. The book continues the lighthearted, humorous exploration of Don’s unique perspective on the world, while also delving deeper into his emotional growth and his efforts to become a better partner. The Rosie Effect explores themes of love, personal growth, and the complexities of parenthood in a funny, insightful way. With Simsion’s signature wit and endearing characters, the novel continues to charm readers with its mixture of humor, heart, and a deep exploration of what it means to truly know and accept someone. It’s a delightful, feel-good story about love, life, and the unpredictable twists that come with it.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/3b/bf/fa/3bbffa42ab46078a7f8b53aa55eb472e.jpg"
      },
      {
        "name": "Shantaram",
        "author": "Gregory David Roberts",
        "categories": ["Adventure", "Thriller"],
        "number_of_pages": 933,
        "year_of_publication": 2003,
        "language": "English",
        "description": "Shantaram by Gregory David Roberts is a sweeping, epic novel set against the vibrant and chaotic backdrop of Bombay, India. The story follows Lin, an Australian fugitive who escapes to India after escaping from an Australian prison. In Bombay, he creates a new life for himself, becoming a part of the city's underworld, and eventually establishing a free clinic in the slums, where he experiences the extremes of human suffering, beauty, and joy. Through his experiences, Lin becomes involved in the criminal underworld, forging complex relationships with a diverse range of people, from gangsters to philosophers. As he grapples with his own past and his moral dilemmas, Lin learns about love, loss, friendship, and the idea of redemption. Shantaram is a tale of self-discovery, filled with adventure, intrigue, and philosophy. The novel is a reflection on the human capacity for change, both good and bad. Roberts’ storytelling is rich and immersive, vividly bringing Bombay and its people to life, while also offering deep philosophical insights into life, love, and fate. The novel's themes of freedom, transformation, and the struggle for identity are explored in a deeply moving way, making Shantaram a memorable and powerful read for fans of adventure and epic tales.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/2b/fd/0a/2bfd0afad7fe3adcf42fcbb4ddc25f91.jpg"
      },
      {
        "name": "Big Little Lies",
        "author": "Liane Moriarty",
        "categories": ["Mystery", "Domestic Fiction"],
        "number_of_pages": 460,
        "year_of_publication": 2014,
        "language": "English",
        "description": "Big Little Lies by Liane Moriarty is a compelling and suspenseful novel that delves into the lives of three women in a small Australian town. The story revolves around Madeline, Celeste, and Jane, whose seemingly ordinary lives are upended by secrets, lies, and a tragic event that will change everything. The novel opens with the aftermath of a school trivia night, during which a violent incident occurs. As the narrative unfolds, the reader learns about the complex relationships, hidden struggles, and personal histories of the three women. Madeline is a vibrant, outspoken woman dealing with the fallout of her second divorce and her complicated relationships with her ex-husband and teenage daughter. Celeste is a successful lawyer trapped in an abusive marriage, while Jane is a shy and reserved woman who has just moved to the town with her son, trying to escape from a dark past. As the story builds toward its dramatic climax, the novel explores themes of friendship, motherhood, domestic violence, and the hidden lives behind closed doors. Moriarty’s writing is sharp, witty, and emotionally astute, drawing readers into the drama and intrigue of the characters’ lives. Big Little Lies is a fascinating exploration of the lies we tell ourselves and others, the price of keeping secrets, and the unexpected ways that lives intersect. It’s a gripping, thoughtful novel that keeps readers on edge until the final page.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/2c/a7/92/2ca79226fa54961d610de24a121ffb30.jpg"
      },
      {
        "name": "Normal People",
        "author": "Sally Rooney",
        "categories": ["Fiction", "Romance"],
        "number_of_pages": 273,
        "year_of_publication": 2018,
        "language": "English",
        "description": "Normal People by Sally Rooney is a poignant and beautifully written novel that explores the complex dynamics of love, friendship, and self-discovery. The story follows Connell and Marianne, two high school classmates from a small Irish town, whose lives become intertwined as they navigate their evolving relationship over the course of several years. Despite their different social backgrounds, Connell and Marianne share a deep, often tumultuous connection that transcends friendship and romance. The novel traces their relationship from their teenage years in high school to their experiences at university, where they face the pressures of growing up, finding their identities, and confronting their insecurities. As Connell and Marianne struggle with their feelings for each other, they are forced to grapple with their own personal demons, including issues of self-worth, family, and societal expectations. Normal People is a sharp, insightful examination of the complexities of intimacy and the ways in which people shape and are shaped by their relationships. Rooney’s writing is understated but powerful, capturing the nuances of emotion and the intricacies of human connection. The novel addresses themes of loneliness, mental health, and the impact of love on personal growth, making it a deeply relatable and thought-provoking read. Normal People has received widespread acclaim for its portrayal of love and its raw, realistic depiction of modern relationships.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/2b/36/de/2b36de985d3469e4356921e9d844d420.jpg"
      },
      {
        "name": "The Shadow of the Wind",
        "author": "Carlos Ruiz Zafón",
        "categories": ["Mystery", "Historical Fiction"],
        "number_of_pages": 487,
        "year_of_publication": 2001,
        "language": "English",
        "description": "The Shadow of the Wind by Carlos Ruiz Zafón is a captivating and atmospheric novel set in post-World War II Barcelona. The story follows Daniel Sempere, a young boy who discovers a mysterious book by an obscure author, Julián Carax, in a hidden library known as the Cemetery of Forgotten Books. As Daniel grows up, he becomes obsessed with learning more about Carax’s life and works. His search leads him into a labyrinth of intrigue, danger, and dark secrets as he uncovers the tragic story behind Carax’s books and the enigmatic figures who are determined to erase every trace of him. Zafón’s novel weaves together elements of mystery, romance, and historical fiction, offering a rich, multilayered narrative that spans generations. The book explores themes of love, loss, betrayal, and the power of literature to shape lives. The Shadow of the Wind is a tribute to the written word, with Zafón’s lush, evocative prose bringing the sights and sounds of Barcelona to life. As the story unfolds, the reader is taken on a journey through the complexities of friendship, passion, and obsession. This novel is a heartfelt homage to the transformative power of books and storytelling, as well as a poignant meditation on memory, fate, and the passage of time.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/c5/8b/74/c58b74fd05e4a2a91b1e3a3a34311b0a.jpg"
      },
      {
        "name": "The Kite Runner",
        "author": "Khaled Hosseini",
        "categories": ["Historical Fiction", "Drama"],
        "number_of_pages": 371,
        "year_of_publication": 2003,
        "language": "English",
        "description": "The Kite Runner by Khaled Hosseini is a deeply moving and emotional novel that explores themes of redemption, forgiveness, and the complexities of friendship. The story centers on Amir, a young boy from a wealthy family in Kabul, Afghanistan, and his complicated relationship with Hassan, the son of his father's servant. The two boys share a close bond, but their friendship is marred by betrayal, a moment of cowardice that shapes Amir's life in profound ways. The novel spans several decades, covering the fall of the Afghan monarchy, the rise of the Taliban, and Amir’s journey to America as an adult. As Amir grapples with his guilt and shame, he returns to Afghanistan to confront his past and seek redemption. The Kite Runner is a poignant exploration of the human desire for forgiveness and the possibility of healing, even in the face of devastating loss. Hosseini’s writing is both lyrical and heartfelt, with vivid descriptions of the Afghan landscape and culture. The novel explores the enduring effects of trauma, the bonds of family, and the ways in which our actions shape the lives of those we love. The Kite Runner has become a modern classic, resonating with readers for its emotional depth and the universal themes of love, loss, and the quest for redemption.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/9d/6a/5b/9d6a5bcfcf52b8cd82a207c3ce12b575.jpg"
      },
      {
        "name": "All the Light We Cannot See",
        "author": "Anthony Doerr",
        "categories": ["Historical Fiction", "War"],
        "number_of_pages": 531,
        "year_of_publication": 2014,
        "language": "English",
        "description": "All the Light We Cannot See by Anthony Doerr is a stunning historical fiction novel set during World War II, following the intertwined stories of a blind French girl and a German soldier. Marie-Laure is a young girl living in Paris when she is blinded by an illness, but her father, a museum locksmith, creates a miniature model of their neighborhood so she can learn to navigate. When the Nazis occupy Paris, Marie-Laure and her father flee to the coastal town of Saint-Malo, where they are separated. Meanwhile, Werner, a German soldier, is conscripted into the military and becomes involved in a mission that ultimately brings him to Saint-Malo. The novel explores the brutality of war and the fragility of life, while also highlighting the resilience of the human spirit and the power of connection. Through lyrical prose and exquisite detail, Doerr paints a vivid portrait of the horrors of war and the ways in which people find light even in the darkest of times. All the Light We Cannot See is a deeply moving and beautifully written novel that masterfully intertwines personal stories with the larger historical context of war, focusing on the impact of war on individuals and the precious moments of humanity that endure amidst the destruction.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/a6/b6/0d/a6b60db2e3a47d1c66e59cf53f1be60d.jpg"
      },
      {
        "name": "The Ocean at the End of the Lane",
        "author": "Neil Gaiman",
        "categories": ["Fantasy", "Magical Realism"],
        "number_of_pages": 181,
        "year_of_publication": 2013,
        "language": "English",
        "description": "The Ocean at the End of the Lane by Neil Gaiman is a beautifully written and atmospheric novel that blends elements of fantasy, childhood memory, and magical realism. The story follows an unnamed middle-aged man who returns to his hometown for a funeral, only to find himself drawn to the house where he grew up. As he reflects on his childhood, he recalls a series of strange and terrifying events that occurred when he was seven years old. At the center of the story is the mysterious and otherworldly girl named Lettie Hempstock, who tells him that the pond behind her house is actually an ocean. As the protagonist recounts the fantastical events from his past, Gaiman weaves a tale of friendship, loss, and the blurred line between memory and reality. The novel is a meditation on childhood innocence, the power of memory, and the lasting impact of events that shape our lives. Gaiman’s prose is poetic and evocative, drawing the reader into a world that is both familiar and dreamlike. The Ocean at the End of the Lane is a poignant and thought-provoking story that lingers in the mind long after the final page is turned.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/c5/be/28/c5be28dae5fe00c1d7fcc3b527d42cd4.jpg"
      },
      {
        "name": "Room",
        "author": "Emma Donoghue",
        "categories": ["Drama", "Thriller"],
        "number_of_pages": 321,
        "year_of_publication": 2010,
        "language": "English",
        "description": "Room by Emma Donoghue is a deeply emotional and harrowing novel that tells the story of a young boy, Jack, and his mother, Ma, who are held captive in a small room for seven years. The novel is narrated by Jack, whose entire world consists of the room where he and Ma are imprisoned. When Ma finally manages to escape, Jack is thrust into a world that is entirely foreign to him, and he must learn to navigate the outside world while grappling with the trauma of their captivity. The novel explores themes of survival, motherhood, and the transformative power of love. Donoghue’s writing is poignant and powerful, offering an intimate and raw portrayal of the psychological effects of confinement and trauma. Room is a heartbreaking yet ultimately hopeful story about resilience, the bond between mother and child, and the process of healing after experiencing unimaginable trauma. The novel’s emotional depth and the unique perspective of Jack make it an unforgettable and moving reading experience.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/23/d3/34/23d334866ec13fd401493ef0919fa027.jpg"
      },
      {
        "name": "The Immortalists",
        "author": "Chloe Benjamin",
        "categories": ["Fiction", "Family"],
        "number_of_pages": 368,
        "year_of_publication": 2018,
        "language": "English",
        "description": "The Immortalists by Chloe Benjamin is a poignant exploration of life, death, and family through the lives of four siblings. The story begins when the siblings—Varya, Daniel, Klara, and Simon—visit a fortune teller as children, who predicts the date of each of their deaths. This prediction sets the course for each sibling's life, as they struggle to live with the knowledge of how long they have left to live. The novel follows them as they grow up, move through different stages of their lives, and come to terms with their respective fates. The Immortalists is a thought-provoking and emotional story about the ways in which people’s lives are shaped by the concept of mortality. Benjamin’s writing is tender and introspective, exploring themes of love, loss, and the complexity of familial bonds. The novel raises important questions about free will, destiny, and the choices we make when faced with the inevitability of death. Each sibling’s journey is distinct, yet they are all connected by their shared experiences and the weight of the fortune teller’s predictions. The Immortalists is a deeply human story that will resonate with readers long after the final page is turned.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/c8/46/1d/c8461d711b176a9fff9f6d27e57f0aea.jpg"
      },
      {
        "name": "The Light We Lost",
        "author": "Jill Santopolo",
        "categories": ["Romance", "Contemporary"],
        "number_of_pages": 368,
        "year_of_publication": 2017,
        "language": "English",
        "description": "The Light We Lost by Jill Santopolo is a beautifully written novel about love, loss, and the passage of time. The story centers on Lucy and Gabe, who meet on the day of the September 11 attacks in New York City. Their connection is instant, and over the course of the years, they navigate their evolving relationship, filled with passion, heartbreak, and missed opportunities. As Lucy and Gabe's paths diverge, they each pursue different dreams and face challenges that test their commitment to one another. The novel explores the choices we make in life and the impact those choices have on our future. Santopolo delves deeply into themes of fate, destiny, and the heart-wrenching complexity of love. The narrative weaves together the highs and lows of a relationship, leaving readers reflecting on their own lives and relationships. The Light We Lost is a poignant and emotional story about the transformative power of love and how the people we meet shape our lives forever.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/e9/99/a9/e999a900dde2c6c4236662c37df8cb5c.jpg"
      },
      {
        "name": "The Silent Corner",
        "author": "Dean Koontz",
        "categories": ["Thriller", "Suspense"],
        "number_of_pages": 400,
        "year_of_publication": 2017,
        "language": "English",
        "description": "The Silent Corner by Dean Koontz is the first book in the Jane Hawk thriller series. The novel follows Jane Hawk, a former FBI agent who is investigating a mysterious series of deaths that seem to be linked to a dangerous technological conspiracy. Jane’s pursuit of the truth takes her on a dangerous journey where she faces powerful enemies who will stop at nothing to protect their secrets. As she uncovers a sinister plot to control people’s minds, Jane is forced to go on the run, using all of her skills and intelligence to survive. The Silent Corner is a fast-paced, high-stakes thriller that blends technology, suspense, and psychological drama. Koontz’s writing is gripping, with numerous twists and turns that keep readers on the edge of their seats. This novel explores themes of control, personal freedom, and the impact of technology on society. The Silent Corner is a thrilling start to a series that promises more action-packed adventures and mind-bending conspiracies.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/94/0c/4d/940c4d218bd1a7b62206c54278a9f576.jpg"
      },
      {
        "name": "The 100-Year-Old Man Who Climbed Out the Window and Disappeared",
        "author": "Jonas Jonasson",
        "categories": ["Comedy", "Fiction"],
        "number_of_pages": 384,
        "year_of_publication": 2009,
        "language": "English",
        "description": "The 100-Year-Old Man Who Climbed Out the Window and Disappeared by Jonas Jonasson is a hilarious and absurd adventure that follows Allan Karlsson, a centenarian who decides to escape his nursing home on his 100th birthday. His impulsive escape sets off a series of improbable events, leading him into a world of criminals, a suitcase full of money, and even more bizarre situations. As Allan recounts his extraordinary life, filled with unlikely encounters with historical figures and world-changing events, the novel’s humor shines through. Jonasson’s writing is witty and filled with absurdities, making this an incredibly fun and lighthearted read. The book is a satire on the absurdity of life, the randomness of fate, and the unexpected ways that seemingly insignificant people influence history. The 100-Year-Old Man Who Climbed Out the Window and Disappeared is an uplifting and laugh-out-loud story that reminds readers that life can be unpredictable, and sometimes, the most extraordinary adventures begin with the simplest of decisions.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/7c/f3/49/7cf34917d235e25e56dd5ab8b936a8e2.jpg"
      },
      {
        "name": "The Tattooist of Auschwitz",
        "author": "Heather Morris",
        "categories": ["Historical Fiction", "Drama"],
        "number_of_pages": 288,
        "year_of_publication": 2018,
        "language": "English",
        "description": "The Tattooist of Auschwitz is a powerful and poignant novel based on the true story of Lale Sokolov, a Jewish man who was imprisoned in the Auschwitz-Birkenau concentration camp during World War II. Forced to work as the camp's tattooist, Lale begins tattooing fellow prisoners with numbers to identify them, but his life changes forever when he meets Gita Furman, a young woman whom he falls in love with. The story details their harrowing experiences in the camp, the resilience of the human spirit, and the remarkable love story that blossomed amidst unimaginable horrors. Heather Morris's writing is emotional, exploring the themes of survival, love, and the impact of trauma on individuals. The book sheds light on the atrocities of the Holocaust and serves as a testament to the strength and hope that can endure even in the darkest times.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/b9/20/74/b920746409a79439e3d94c9c3dbbfd04.jpg"
      },
      {
        "name": "The Night Watchman",
        "author": "Louise Erdrich",
        "categories": ["Historical Fiction", "Literary Fiction"],
        "number_of_pages": 464,
        "year_of_publication": 2020,
        "language": "English",
        "description": "The Night Watchman by Louise Erdrich is an award-winning novel set in the 1950s, inspired by the life of the author’s grandfather, a Chippewa tribal chairman. The story follows Thomas Wazhashk, a night watchman at a factory in North Dakota, who is also a fierce advocate for Native American rights. The novel explores the impact of government policies on Native communities, particularly the struggle to resist the termination of Native American tribes. Erdrich's writing weaves together themes of family, identity, resistance, and the emotional toll of living between two worlds. The Night Watchman is a deeply moving and beautifully crafted exploration of Native American history and culture, with characters that are both relatable and unforgettable.",
        "comments":0,
        "image_url": "https://i.pinimg.com/736x/4d/91/bc/4d91bce53abef9dd2a13643c03d07fde.jpg"
      },
      {
        "name": "A Man Called Ove",
        "author": "Fredrik Backman",
        "categories": ["Fiction", "Humor"],
        "number_of_pages": 368,
        "year_of_publication": 2012,
        "language": "English",
        "description": "A Man Called Ove by Fredrik Backman is a heartwarming novel about a grumpy, isolated man named Ove who has lost his sense of purpose after the death of his wife. Ove is set in his ways, and his interactions with his neighbors are often blunt and unfriendly. However, when a new family moves in next door, Ove’s life begins to change in unexpected ways. The novel is a touching and humorous exploration of love, loss, and the importance of human connection. Backman’s writing is poignant and full of warmth, as Ove’s gruff exterior slowly melts away to reveal the complexity of his character. A Man Called Ove is a story that reminds readers that kindness and community can come from the most unlikely places.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/e0/c6/b3/e0c6b3ca084b1b4099c0a0e5354817d4.jpg"
      },
      {
        "name": "Eleanor Oliphant Is Completely Fine",
        "author": "Gail Honeyman",
        "categories": ["Contemporary Fiction", "Humor"],
        "number_of_pages": 390,
        "year_of_publication": 2017,
        "language": "English",
        "description": "Eleanor Oliphant Is Completely Fine by Gail Honeyman is a darkly comic and deeply moving novel about Eleanor Oliphant, a socially awkward, solitary woman with a routine life that is upended when she begins to connect with others. Eleanor’s unconventional personality and peculiar habits make her an outsider, but as she starts to open up to those around her, she begins to confront the traumatic past that has shaped her. This novel is a journey of self-discovery, friendship, and healing. Honeyman’s writing is both witty and poignant, blending humor with moments of deep emotional insight. Eleanor’s story is a reminder of the importance of human connection and the transformative power of kindness.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/20/b2/64/20b2643718e1e5ad719653c9efd24de3.jpg"
      },
      {
        "name": "The Song of Achilles",
        "author": "Madeline Miller",
        "categories": ["Mythology", "Historical Fiction"],
        "number_of_pages": 370,
        "year_of_publication": 2011,
        "language": "English",
        "description": "The Song of Achilles by Madeline Miller is a lyrical retelling of the Iliad from the perspective of Patroclus, the companion and lover of Achilles. The novel explores their deep bond, the complexities of their relationship, and the tragic events that unfold during the Trojan War. Miller brings to life the mythological world with vivid detail, while focusing on the humanity of the characters involved. The book delves into themes of love, fate, and sacrifice, offering a fresh and emotional take on the well-known Greek myths. The Song of Achilles is a beautifully written and deeply moving story that explores the depths of human connection and the consequences of war.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/bb/3b/bb/bb3bbbb5a4b4584a184302cd5104dca4.jpg"
      },
      {
        "name": "The Book of M",
        "author": "Peng Shepherd",
        "categories": ["Science Fiction", "Dystopian"],
        "number_of_pages": 496,
        "year_of_publication": 2018,
        "language": "English",
        "description": "The Book of M by Peng Shepherd is a dystopian science fiction novel set in a world where people begin to lose their memories in a mysterious phenomenon known as the 'forgetting.' The story follows a group of characters as they navigate this strange new world, where the loss of memory causes individuals to reinvent themselves and their relationships. At the heart of the novel is the story of Ory and Max, a couple who are struggling to survive in this shifting world. The Book of M explores themes of memory, identity, and the human connection, offering a profound meditation on what it means to lose and rediscover oneself.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/e8/e8/87/e8e88778914fb43693887fe0415637e9.jpg"
      },
      {
        "name": "An American Marriage",
        "author": "Tayari Jones",
        "categories": ["Contemporary Fiction", "Drama"],
        "number_of_pages": 320,
        "year_of_publication": 2018,
        "language": "English",
        "description": "An American Marriage by Tayari Jones is a poignant and heart-wrenching novel that tells the story of Celestial and Roy, a married couple whose lives are torn apart when Roy is wrongfully imprisoned for a crime he did not commit. The novel explores the impact of incarceration on relationships, the complexity of love, and the endurance of the human spirit. Jones' writing is powerful and moving, delving into themes of race, justice, and personal identity. An American Marriage is a timely and compelling examination of the challenges facing modern couples, particularly in the context of systemic racism and the criminal justice system.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/90/d1/6c/90d16cd02c5c9280ccc03759e563c119.jpg"
      },
      {
        "name": "Think Big",
        "author": "Ben Carson",
        "categories": ["Self-Help", "Motivational"],
        "number_of_pages": 320,
        "year_of_publication": 1992,
        "language": "English",
        "description": "Think Big by Dr. Ben Carson is a motivational book that aims to inspire readers to reach their full potential by thinking big and striving for greatness. Dr. Carson, a world-renowned neurosurgeon, shares his personal story of overcoming adversity and offers practical advice on how to overcome challenges, enhance self-esteem, and cultivate a mindset for success. Drawing from his own experiences, including growing up in a tough environment, Carson provides strategies for achieving personal and professional goals, while emphasizing the importance of faith, education, and perseverance. The book covers topics such as time management, critical thinking, and decision-making, all aimed at helping individuals pursue their dreams and unlock their true potential. With its blend of personal anecdotes and practical insights, Think Big encourages readers to dream beyond their circumstances and take control of their lives. Carson’s philosophy is simple yet profound: by thinking big and believing in your abilities, you can accomplish anything. The book has been an inspiration to countless individuals who have used Carson’s advice to improve their lives and achieve extraordinary success, both professionally and personally.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/48/9c/df/489cdfe4f9b35e9908f9da8212144460.jpg"
      },
      {
        "name": "The Seven Husbands of Evelyn Hugo",
        "author": "Taylor Jenkins Reid",
        "categories": ["Romance", "Historical Fiction"],
        "number_of_pages": 400,
        "year_of_publication": 2017,
        "language": "English",
        "description": "The Seven Husbands of Evelyn Hugo by Taylor Jenkins Reid is a compelling and emotionally rich novel that chronicles the glamorous and tumultuous life of Evelyn Hugo, an aging Hollywood icon. The novel is framed as an interview, with Evelyn telling her life story to an unknown journalist, Monique Grant. Through Evelyn’s seven marriages, the book explores themes of love, fame, sacrifice, and the complex nature of identity. Reid masterfully blends romance, drama, and mystery, keeping readers hooked as Evelyn reveals the truth behind her legendary persona and the deep secrets she has kept hidden for decades.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/07/08/9d/07089d136558ecd54d1ccd4df667ea11.jpg"
      }
      ,{
        "name": "The Water Dancer",
        "author": "Ta-Nehisi Coates",
        "categories": ["Historical Fiction", "Literary Fiction"],
        "number_of_pages": 416,
        "year_of_publication": 2019,
        "language": "English",
        "description": "The Water Dancer by Ta-Nehisi Coates is a powerful and magical novel that explores the legacy of slavery and the experiences of a young man named Hiram Walker, who possesses a mysterious power known as 'conduction.' Hiram’s journey begins when he is separated from his family as a child and later escapes slavery. The novel is set against the backdrop of the American South before the Civil War and incorporates elements of magical realism. Coates examines themes of memory, freedom, and resistance, offering a deeply reflective and haunting narrative that highlights the intersection of history and personal identity.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/fe/8d/52/fe8d522acdc49ee746c60479cbac177d.jpg"
      },
      {
        "name": "The Invisible Life of Addie LaRue",
        "author": "V.E. Schwab",
        "categories": ["Fantasy", "Romance"],
        "number_of_pages": 442,
        "year_of_publication": 2020,
        "language": "English",
        "description": "The Invisible Life of Addie LaRue by V.E. Schwab is a beautifully crafted novel about a woman who makes a deal with the devil to live forever, only to be forgotten by everyone she meets. For over 300 years, Addie wanders the world, leaving a trail of broken relationships and lost memories. However, everything changes when she meets a man who remembers her. This novel explores themes of love, memory, and the consequences of immortality. Schwab’s writing is lyrical and evocative, weaving together the beauty of time, history, and the search for meaning in a world that forgets you.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/a8/4f/ed/a84fed08a7e7f5f27f85c18b48773d2b.jpg"
      },
      {
        "name": "Me Talk Pretty One Day",
        "author": "David Sedaris",
        "categories": ["Comedy", "Memoir"],
        "number_of_pages": 272,
        "year_of_publication": 2000,
        "language": "English",
        "description": "Me Talk Pretty One Day is another hilarious collection of essays by David Sedaris, showcasing his sharp, sarcastic humor and remarkable wit. In this book, Sedaris reflects on his move to Paris, his struggles with learning French, and his experiences with his eccentric family members. From absurd observations about language barriers to humorous critiques of modern society, Sedaris’s writing never fails to entertain. His distinct comedic style, paired with his ability to find humor in the everyday, makes this book a must-read for anyone in need of a good laugh.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/8b/5e/fa/8b5efa23c9a8c0ef1be4fef4e8506790.jpg"
      },
      {
        "name": "The Importance of Being Earnest",
        "author": "Oscar Wilde",
        "categories": ["Comedy", "Play"],
        "number_of_pages": 96,
        "year_of_publication": 1895,
        "language": "English",
        "description": "The Importance of Being Earnest is one of Oscar Wilde’s most famous plays, known for its brilliant wit, sharp satire, and social commentary. The play revolves around two men who lead double lives and become entangled in a web of mistaken identities, romantic entanglements, and absurd situations. Wilde’s humor shines through in every line, as he explores themes of love, marriage, and the superficiality of societal norms. The Importance of Being Earnest remains a timeless comedy, beloved for its clever dialogue and its ability to make light of the conventions of Victorian society.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/9b/20/c8/9b20c862e968c43751e959dbb3866906.jpg"
      },
      {
        "name": "Catch-22",
        "author": "Joseph Heller",
        "categories": ["Comedy", "War Fiction"],
        "number_of_pages": 453,
        "year_of_publication": 1961,
        "language": "English",
        "description": "Catch-22 by Joseph Heller is a satirical novel set during World War II that humorously critiques the absurdities of war and bureaucracy. The book follows Yossarian, a U.S. bomber pilot, as he navigates the insanity of military life, where the rules are designed to trap individuals in a never-ending cycle of contradictions. The term 'Catch-22' has come to symbolize any illogical and self-perpetuating regulation, making this novel an enduring commentary on the futility of war and the madness of institutionalized systems. With dark humor and sharp wit, Catch-22 is a literary classic that remains relevant today.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/8b/0e/bb/8b0ebb3f046c1fcd1e6a57a464ebaee2.jpg"
      },
      {
        "name": "The Life and Opinions of Tristram Shandy, Gentleman",
        "author": "Laurence Sterne",
        "categories": ["Comedy", "Literary Fiction"],
        "number_of_pages": 640,
        "year_of_publication": 1759,
        "language": "English",
        "description": "The Life and Opinions of Tristram Shandy, Gentleman by Laurence Sterne is one of the earliest examples of postmodern literature and a pioneering work of comic fiction. The novel tells the story of Tristram Shandy, who narrates his life in a fragmented, humorous, and highly unconventional manner, often breaking the fourth wall and drawing attention to the absurdity of storytelling itself. With its playful approach to narrative structure, Tristram Shandy is a witty, philosophical, and highly original work that both entertains and challenges readers with its comedic exploration of the self and the nature of time.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/f0/7e/ae/f07eae7ba3167c5b54fb0449c87c398b.jpg"
      },
      {
        "name": "Good Omens",
        "author": "Neil Gaiman, Terry Pratchett",
        "categories": ["Comedy", "Fantasy"],
        "number_of_pages": 412,
        "year_of_publication": 1990,
        "language": "English",
        "description": "Good Omens is a comedic masterpiece by Neil Gaiman and Terry Pratchett. It follows the unlikely partnership between an angel, Aziraphale, and a demon, Crowley, as they team up to prevent the apocalypse. With humor, wit, and clever observations on humanity, the book hilariously explores themes of good versus evil, fate, and friendship. The absurdity of their efforts to stop Armageddon—made all the more fun by the quirky characters they encounter—provides a satirical and entertaining read. Fans of Gaiman and Pratchett's unique styles will appreciate the vibrant world of angels, demons, and a confused Antichrist, making this a true comedic gem.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/7a/75/1c/7a751c06dfcee382e6da69536c31b39f.jpg"
      },
      {
        "name": "Bossypants",
        "author": "Tina Fey",
        "categories": ["Comedy", "Biography"],
        "number_of_pages": 275,
        "year_of_publication": 2011,
        "language": "English",
        "description": "Bossypants is Tina Fey’s witty, insightful, and hilarious memoir, covering everything from her early years in comedy to her time on Saturday Night Live and 30 Rock. With her signature humor, Fey recounts stories of her personal and professional life, sharing behind-the-scenes insights, self-deprecating humor, and biting commentary on the entertainment industry. Her narrative style is hilarious and full of heart, offering both laughs and wisdom on topics like feminism, success, and navigating life’s awkward moments. Bossypants is both laugh-out-loud funny and deeply relatable.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/b0/e6/06/b0e606f1f3dcaf3a7dc470b34fd108bc.jpg"
      },
      {
        "name": "Let's Explore Diabetes with Owls",
        "author": "David Sedaris",
        "categories": ["Comedy", "Memoir"],
        "number_of_pages": 368,
        "year_of_publication": 2013,
        "language": "English",
        "description": "Let’s Explore Diabetes with Owls is a hilarious collection of personal essays by David Sedaris, one of the most celebrated humorists of our time. In his unique and sardonic voice, Sedaris reflects on his travels, childhood memories, family dynamics, and more, offering insight into the oddities of human nature. His sharp wit and observations about life’s absurdities make for an unforgettable reading experience. Whether he’s recounting his experience with diabetes or the quirky encounters during his travels, Sedaris's comedic timing and relatable storytelling ensure constant laughter throughout.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/f0/9f/da/f09fdac2e60d9cd684d48172bd1d979f.jpg"
      },
      {
        "name": "Zombieland: Double Tap – Double Fear",
        "author": "Rhett Reese, Paul Wernick",
        "categories": ["Comedy", "Horror"],
        "number_of_pages": 320,
        "year_of_publication": 2019,
        "language": "English",
        "description": "Zombieland: Double Tap – Double Fear is the official tie-in novel to the popular horror-comedy film Zombieland: Double Tap. Written by the creators of the film, Rhett Reese and Paul Wernick, the novel follows the misfit group of survivors—Columbus, Tallahassee, Wichita, and Little Rock—as they continue their journey through a post-apocalyptic world filled with zombies. The book delivers the same dark humor, ridiculous situations, and witty dialogue that fans of the franchise love, all while adding new layers to the characters' personalities and challenges. Through their hilarious misadventures, the group faces off against mutated zombies, unexpected encounters, and their own personal growth. It’s a fun, fast-paced read for those who enjoy a combination of dark comedy and zombie mayhem.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/4b/0c/f2/4b0cf2331bb14a450dc4f15250333912.jpg"
      },
      {
        "name": "Quidditch Through the Ages",
        "author": "J.K. Rowling",
        "categories": ["Comedy", "Fantasy"],
        "number_of_pages": 134,
        "year_of_publication": 2001,
        "language": "English",
        "description": "Quidditch Through the Ages is a fictional history book written by J.K. Rowling, set in the world of Harry Potter. Presented as a non-fiction guide to the wizarding sport of Quidditch, the book is filled with amusing anecdotes, quirky facts, and detailed descriptions of the game's history, rules, and legendary players. With a humorous tone, Rowling offers an in-depth look at the magical sport, its evolution, and the oddities surrounding it, all from the perspective of a fictional author, Kennilworthy Whisp. The book includes comical illustrations, playful commentary, and behind-the-scenes glimpses of the magical sport, making it a delightful read for Harry Potter fans and those seeking light-hearted comedy.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/736x/ac/d4/dd/acd4dd3fbfae41808310b457b9b58c13.jpg"
      },
      {
        "name": "Ready or Not",
        "author": "Meg Cabot",
        "categories": ["Comedy", "Romance"],
        "number_of_pages": 336,
        "year_of_publication": 2009,
        "language": "English",
        "description": "Ready or Not is a delightful romantic comedy by Meg Cabot, part of her popular ‘Heather Wells’ series. The novel follows Heather Wells, a former pop star turned college dormitory resident advisor, as she gets caught up in yet another set of bizarre situations. In this book, Heather must navigate the complexities of relationships, work, and family drama while also dealing with a new mysterious death at the college dorm. As always, Heather’s witty, self-deprecating humor provides the backbone of the narrative, and the book is filled with amusing mishaps, quirky characters, and an evolving romance that adds just the right amount of charm. Meg Cabot's signature style shines through as she expertly blends comedy, suspense, and romance. Ready or Not offers both humor and heart, with a cast of colorful characters and a plot that balances lightheartedness with moments of unexpected depth. For fans of romantic comedies, this book is an entertaining and fun read that explores themes of love, friendship, and discovering one’s true self.",
        "comments": 0,
        "image_url": "https://i.pinimg.com/474x/0d/92/21/0d92218bd0479a9c834c79318dc62543.jpg"
      }
      
      
      
    ]
}
  